def getGG88(sn):
    Code_list = {
        'HUN':'新台幣100元', 
        'TWO':'新台幣200元', 
        'THR':'新台幣300元',
        'FOR':'新台幣400元',
        'FIV':'新台幣500元',
        'SIX':'新台幣600元',
        'SEV':'新台幣700元',
        'EGT':'新台幣800元',
        'NIN':'新台幣900元',
        'THO':'新台幣1,000元',
        'ELE':'新台幣1,100元',
        'TWL':'新台幣1,200元',
        'TRN':'新台幣1,300元',
        'TFH':'新台幣1,400元',
        'FTN':'新台幣1,500元',
        'STN':'新台幣1,600元',
        'SEN':'新台幣1,700元',
        'EGN':'新台幣1,800元',
        'TOP':'頭獎',
        '呱:TOP':'瓜哩誒大頭～',
    }

    try: sn_name = Code_list[sn]
    except: return "沒有中獎喔～"
    return sn_name
